brianreborn/pqfreebsd/skills/pqfreebsd/man/man7/pqfreebsd.7
.Dd August 22, 2026
.Dt PQFREEBSD 7
.Os
.Sh NAME
.Nm pqfreebsd
.Nd post-quantum trusted FreeBSD: a paper built on pqac(7)
.Sh SYNOPSIS
.Nm
is the living paper of the suite.
.Xr pqac 7
is the basis; this page builds onward as morphisms land.
.Bd -literal -offset indent
mandoc -T pdf pqac.7 > pqac.pdf
mandoc -T pdf pqfreebsd.7 > pqfreebsd.pdf
mandoc -T lint pqfreebsd.7
.Ed
.Sh ABSTRACT
.Xr pqac 7
argued that
.Em A_D ,
.Em A_M ,
and MMU translation are quantum-adversary-stable mediation on a von Neumann
.Fx
defender: not post-quantum cryptography, not a quantum ISA.
T1 and T2 are implemented by
.Nm freebsd-mac-grok .
T3–T5 remain the plant and the observation function
.Em O .
.Pp
.Nm
is the trusted base around that mediation.
It is not Kyber in the kernel.
It packages Anderson's third property, the residual access matrix,
successive policy as an auditable object, claims that degrade by conjunct,
a catalog of the cryptographic chain of trust, parameterized bounds, a
a loader gated on attestation, and a port that will not pretend a pkg is the operator.
.Pp
The system is not therefore post-quantum secure.
Mediation does not collapse under Shor; the bits the monitor interprets
still may.
This paper records what holds, what is held, and where each proof stops.
.Sh BASIS
Read
.Xr pqac 7
first.
The defender is GENERIC with
.Ql options MAC .
The adversary is
.Em BQP
plus Grover, plus a hypothesized instrument on the plant
.Pq T3 .
Exoterically, DAC, LOMAC, and the MMU are interpreted predicates; they do
not reduce to period-finding.
Esoterically those predicates are electrical events; if
.Em O
does not factor through a kernel-visible subject, T1 and T2 are silent.
.Pp
This page does not re-prove T1–T5.
It inherits them and names the morphisms the slogans omitted.
.Sh TRUSTEDBSD
.Nm
composes the
.Em TrustedBSD MAC Framework ,
not a private access-control kernel.
That framework
.Pq loadable
.Xr mac 4
policy modules, labels, hooks
shipped in
.Fx
5.0.
.Xr mac 4
and
.Xr mac 9
in the base system name it; they do not reprint the papers.
.Pp
Project:
.Lk http://www.trustedbsd.org/ "TrustedBSD Project"
.Pp
Papers not in the base install
.Pq index :
.Lk http://www.trustedbsd.org/docs.html "trustedbsd.org/docs.html"
.Bl -bullet
.It
Watson,
.Dq Introducing Supporting Infrastructure for Trusted Operating System Support in FreeBSD ,
BSDCon 2000.
.Lk http://www.trustedbsd.org/trustedbsd-bsdcon-2000.pdf
.It
Watson,
.Dq TrustedBSD: Adding Trusted Operating System Features to FreeBSD ,
USENIX ATC FREENIX 2001.
.Lk http://www.trustedbsd.org/trustedbsd-freenix-2001.pdf
.It
Watson, Feldman, Migus, Vance,
.Dq Design and Implementation of the TrustedBSD MAC Framework ,
DARPA DISCEX III 2003.
.Lk http://www.trustedbsd.org/trustedbsd-discex3.pdf
.It
Watson, Morrison, Vance, Feldman,
.Dq The TrustedBSD MAC Framework: Extensible Kernel Access Control for FreeBSD 5.0 ,
USENIX ATC FREENIX 2003.
.Lk http://www.trustedbsd.org/trustedbsd-usenix2003freenix.pdf
.It
Vance and Watson,
.Dq Security-Enhanced BSD ,
NAI Labs, July 2003
.Pq FLASK/TE on the Framework; Nm mac-sebsd
is not a 1.0 skill .
.Lk http://www.trustedbsd.org/sebsd-july2003.pdf
.Lk http://www.trustedbsd.org/sebsd.html
.It
Watson and Salamon,
.Dq The FreeBSD Audit System ,
UKUUG LISA 2006.
Index:
.Lk http://www.trustedbsd.org/docs.html
.Lk http://www.trustedbsd.org/audit.html
.It
Watson,
.Dq New Approaches to Operating System Security Extensibility ,
UCAM-CL-TR-818, 2012.
.Lk https://www.cl.cam.ac.uk/techreports/UCAM-CL-TR-818.pdf
.It
Watson,
.Dq A Decade of OS Access-Control Extensibility ,
CACM 56(2) / ACM Queue, 2013.
.Lk https://queue.acm.org/detail.cfm?id=2436814
.El
.Pp
Handbook
.Pq also not a man page :
.Lk https://docs.freebsd.org/en/books/handbook/mac/ "Handbook: MAC"
.Lk https://docs.freebsd.org/en/books/handbook/audit/ "Handbook: audit"
.Lk https://docs.freebsd.org/en/books/arch-handbook/mac/ "Architecture Handbook: MAC Framework"
.Pp
.Xr mac_lomac 4
is a TrustedBSD policy module
.Pq floating-label Biba-like integrity .
Fraser's LOMAC paper is Linux; the
.Fx
module is the Framework port.
OpenBSM is the TrustedBSD audit implementation
.Pq Xr audit 4 .
.Sh LABELS
.Xr mac_lomac 4
is the integrity lattice.
When speaking to an operator, say
.Sy high-integrity
and
.Sy low-integrity .
Do not say only
.Ql high
or
.Ql low
as if those were self-explanatory.
.Pp
.Bl -tag -width low-integrityxx
.It high-integrity
OS and other files a lowered process must not overwrite.
Kernel:
.Ql lomac/high
.Pq subjects: Ql lomac/high(low-high) .
.It low-integrity
User files, agents, home directories, and the level a process drops to after
reading them.
Kernel:
.Ql lomac/low
for objects;
.Ql lomac/10[2]
for a process that starts already lowered.
Those are the same integrity in speech.
.It exempt
Outside the lattice.
Root
.Ql equal(equal-equal)
is exemption, not containment.
.El
.Pp
Short proof: a low-integrity process cannot overwrite a high-integrity OS
file after reading low-integrity data.
.Sh THIS SUITE
.Nm freebsd-mac-grok
ships
.Nm freebsd-mac-lomac
.Pq roles as groups, official PLM, PREINSTALL ,
.Nm freebsd-mac-generic
.Pq orthogonal modules ,
and the umbrella
.Pq Xr zfs 8 Cm snapshot Fl r ,
no
.Xr bectl 8 .
.Nm
composes those packages and adds:
.Bl -bullet
.It
.Nm pqledger
— Integrity Evidence, high in
.Em L
.It
.Nm pqdac
— restricted
.Em A_D ,
establish / repair / prevent
.It
.Nm pqaudit
—
.Cm oneaudit ,
.Cm onepropagate ,
chained catalog hashes
.It
.Nm pqboot
— loader gated on attestation; TPM not this pass; splash art is not the claim
.It
.Nm sysutils/pqfreebsd
— in-tree port; skill-capable LLM attested before via-port
.Cm oneenforce
.El
.Pp
Held until named as skills:
.Nm pqconfirm ,
.Nm pqzfs ,
.Nm mac-sebsd ,
measured boot.
.Nm pqcode
is held and open-ended; it is
.Em not
a 1.0 requirement.
.Sh SKILLS
One skill per
.Em proof ,
not per
.Pa .ko
and not per similar rc.d texture.
.Pp
.Nm freebsd-mac
is the administrative texture: snapshot, PREINSTALL,
.Cm test* / one* ,
compose.
.Nm freebsd-mac-lomac
is the integrity lattice
.Pq high-integrity / low-integrity; groups as the role binding .
.Nm freebsd-mac-generic
is the catalog of orthogonal modules that share that texture
.Pq Xr mac_seeotheruids 4
by default; ifoff, partition, portacl, biba, mls, none stay in the catalog
until enabled, not as new top-level skills .
Do not fork a skill because the daemon is copy-paste.
.Pp
Do
.Em not
put LOMAC and SEBSD under an
.Dq RBAC
skill.
RBAC is roles, permissions, sessions.
LOMAC is a Biba-like integrity lattice.
SEBSD is Type Enforcement
.Pq FLASK, types, a compiled policy language .
Groups-as-roles is how this suite
.Em binds
humans and agents to those axioms; it is not the axiom.
A skill named RBAC that loaded both would teach the operator that types
are grades.
They are not.
Conjunction is not a product of proofs
.Pq Xr pqac 7 .
.Pp
.Nm mac-sebsd
remains a separate skill, created only when the operator names it: different
language, different compiler, unsigned policy is code-equivalent
.Pq T11 .
.Nm pqzfs
and
.Nm pqcode
are different games
.Pq store, signatures
even if the rc.d looks familiar.
.Nm pqdac
is restricted
.Em A_D ,
not a second lattice.
.Sh THESES
Deniable separately.
T1–T5 remain
.Xr pqac 7 .
.Bl -tag -width T10xx
.It T1
Membership in
.Em BQP
does not by itself produce a classical write accepted by the reference
monitor.
.It T2
.Em A_D ,
.Em A_M ,
and MMU translation are quantum-adversary-stable mediation.
They are post-quantum access control in that sense, and not post-quantum
cryptography.
.It T3
.Pq working hypothesis
Some instrument on the plant, possibly entanglement-enhanced, can
distinguish defender computation.
.It T4
If
.Em O
factors through a kernel-visible subject, T1 and T2 constrain
.Em O .
If not, T1 and T2 are silent and the property is physical non-interference.
.It T5
Quantum advantage for
.Em O
is not free, and is not Shor's corollary.
.It T6
Unrestricted
.Em A_D
is an HRU protection system; safety is undecidable.
A restricted specification
.Pq path-regex to owner, group, mode, inherit
plus a repair morphism is a different relation: intended
.Em A_D
is restored; residual owner-grants are bounded in duration.
This does not make
.Em A_D
into
.Em A_M .
.It T7
.Xr mac 4
approximates complete mediation and isolation.
Verifiability is not supplied.
A hash-chained ledger of vnode, label, and policy-morphism events is the
monitor's evidence.
The ledger object is high in
.Em L .
Tampering is a hash-collision problem
.Pq Grover halves the bits; production uses SHA-512 or SHA-3 .
That is
.Em A_auth
of the evidence, not of the subject.
The suite still does not
.Xr kldload 8
Kyber.
.It T8
Dynamic establishment is the create-time morphism.
Repair is the restore morphism when actual is not intended.
.Xr setfsmac 8
first-match and DAC first-match are combinators, not lattice operations.
Conjunction with
.Em A_M
is still not a product of proofs.
Optional prevention
.Pq Xr ugidfw 8
is a different module with a different proof
.Pq empty ruleset is allow-all .
.It T9
The ledger daemon is a subject.
If
.Em O
factors through it, T4 applies.
The ledger is not Faraday, not a naming retrofit, and not a secrecy lattice.
Recovery remains inside the isolation claim.
.It T10
.Pq required; not this pass
.Em A_M
constrains who may write.
The ledger records that a write occurred.
Neither lets a later subject confirm that the bits they read are the bits
that were written.
.Xr zfs 8
checksums detect silent corruption inside the pool; they are not a
subject-visible confirmation API.
A content digest, or a Merkle over the labeled store, bound to a ledger
checkpoint, is confirmable to the extent of the hash.
Grover halves the bits.
Next skill:
.Nm pqconfirm .
.It T11
.Pq held; open-ended; not a 1.0 requirement
A PQ-stable monitor interpreting RSA-signed code is a forged policy,
correctly enforced.
Kernel, klds, pkg, policy, and
.Xr zfs 8
send streams are code, or code-shaped.
If they are unsigned, or signed with RSA/ECC, Shor forges the input to
.Em A_M .
Authentication here is of code, not of credentials.
Redundancy is two independent reductions: ML-DSA
.Pq FIPS 204
and SLH-DSA
.Pq FIPS 205
— not two disks.
The catalog remains.
.Nm pqcode
is cut when named, not as a 1.0 gate.
Do not claim the chain is unbroken.
.It T12
.Pq gated; TPM not this pass
.Cm oneboot
is refused until the operator attests they are sufficiently satisfied that
the system is post-quantum hardened to the degree that gives them a sense of
security.
Default is no.
What the gate protects is taking the loader off the unsigned GENERIC path,
only as far as this pass can close.
TPM and measured boot are not this pass.
Changing the splash name and mark is a consequence of that attestation, not
a security claim.
Branding is not a second signature family.
Do not rebrand a box you do not yet trust.
.It T13
After install, the operator must see that POLICY, SUITE, DAC, ugidfw, login
labels, MAC overlays, and the loader config agree; must propagate a change through
all of them at once; and must read the diff of successive iterations.
Consistency is a predicate over that conjunction, not a product of proofs.
Each propagation is a named revision whose catalog hash is chained and
recorded in the ledger.
An audit that cannot show what changed is not an audit.
.Cm oneaudit ,
.Cm onepropagate .
.It T14
Claims degrade by conjunct, not as a product.
A missing or stranded protocol weakens only the claims that named it.
If the box cannot securely transport the Integrity Evidence to another host
and have that host validate the store, the off-host IE claim is degraded.
High-integrity overwrite protection, local chain, repaired
.Em A_D ,
successive policy, and the loader gate are not thereby false.
Silent
.Pq module not included
is not degraded
.Pq module included, protocol unmet .
Do not report the suite as a single bit.
.It T15
.Pq held
An unbroken cryptographic chain of trust is a necessary requirement of the
trusted base, distinct from T2.
Walk firmware db, loader, kernel, kld, pkg, freebsd-update, policy, rc.d,
ledger checkpoint, zfs send, replica transport.
Each hop that is cryptography must eventually be post-quantum:
ML-DSA and SLH-DSA for signatures, ML-KEM
.Pq FIPS 203
for transport, SHA-512 or SHA-3 Grover-accounted for hashes.
AES-at-rest is secrecy, not origin.
Hybrid is a transition particular; Shor still forges the classical half.
A classical or missing hop breaks the chain from that point down.
It does not un-prove high-integrity overwrite protection
.Pq T14 .
This pass catalogs the hops.
It does not claim the chain is unbroken.
.It T16
At the end of beta the system is provably secure up to the conjunction of
named bounds, and no further.
Each claimed measure states what is proven, where the proof stops, and
expected resistance against classical PPT, qubit BQP
.Pq Grover, Shor, BHT ,
qudit / non-binary quantum, and continuous-variable machines.
Mediation is n/a bits in every model.
Cryptographic particulars have numbers, already birthday- and
Grover-accounted, or an honest 0.
A zero on pkg-RSA does not zero high-integrity overwrite protection.
Empty bounds are the remainder of the work.
Do not ship
.Dq provably secure
without this sheet.
.It T17
.Nm sysutils/pqfreebsd
is the intended install path once the skills exist.
It stages; it does not
.Xr kldload 8 .
Intended operation is by a sufficiently advanced large language model that
can operate the skills
.Pq interview, Cm test* before Cm one* , Known issues, this paper .
The port cannot prove a model is advanced.
Local GPU/CPU OPTIONS:
.Nm ollama ,
.Nm llama.cpp
.Pq llama-server ,
LocalAI, llamafile, vLLM, koboldcpp.
Native path is CPU and Vulkan.
CUDA on
.Fx
is typically Linuxulator.
.Nm pqfreebsd-llm-check
finds a candidate;
.Va pqfreebsd_llm_attested=YES
is the operator's conjunct.
via-port
.Cm oneenforce
is refused without it.
That conjunct is the install path, not
.Em A_M
.Pq T14 .
Hand install from the skill tree does not set
.Pa VIA-PORT .
.El
.Sh LEDGER
An empty chain is not evidence.
The first record names the policy hash, the dataset, and the hash.
.Xr audit 4
is the in-band source;
.Pa /var/audit
is not the chain.
Rotation appends a checkpoint record.
Rewrite is a bug.
Label the dataset
.Ql high
before
.Cm enforce
or it is an unlabeled hole.
If a replica module is included, a second host stores and validates HEAD.
Network-stranded transport degrades only that claim
.Pq T14 .
.Sh A_D
The spec is a restricted language: path-regex, owner, group, mode.
No arbitrary grant verbs
.Pq the HRU cut .
First-match, same combinator as
.Xr setfsmac 8 .
.Cm observe
logs;
.Cm repair
restores after the syscall
.Pq a concurrent reader may see drift ;
.Cm prevent
generates
.Xr ugidfw 8
from the same spec.
Empty ugidfw is allow-all.
.Sh SUCCESSIVE POLICY
.Cm onepropagate
regenerates DAC, ugidfw, login fragment, overlay, and splash artifacts from
POLICY, applies, and appends a catalog hash chained to the previous
revision.
.Cm oneaudit
walks consistency and the kv-diff of live versus applied.
An audit that cannot show what changed is not an audit.
.Sh CHAIN OF TRUST
Origin hops, firmware to replica, are catalogued; see the workbench
.Pa Code
page and T15.
Today the chain of origin breaks at hop 1
.Pq UEFI RSA
or earlier if unsigned.
Hash-only hops are integrity, not origin, until a PQ signature covers the
root.
.Sh BOUNDS
The beta-end sheet
.Pq T16
names, for each remaining claim, classical bits or n/a, qubit BQP, qudit,
and CVQC, what is proven, and where the proof stops.
Mediation is n/a in every model: a qudit or analog machine still writes
through the hook.
Fill the sheet as modules land.
.Sh BOOT
The claim is the gate
.Pq T12 .
.Cm oneboot
is refused while
.Va BOOT_SATISFIED
is no.
After attestation it takes the loader off unsigned GENERIC only as far as
this pass can close.
TPM is not this pass.
A Forth mark
.Pq cross by default
may replace the stock splash; that is cosmetic.
.Sh PORT
Copy
.Pa ports/sysutils/pqfreebsd
to
.Pa /usr/ports/sysutils/pqfreebsd .
OPTION LLM
.Pq default
installs
.Nm pqfreebsd-llm-check
and the via-port refuse.
A sufficiently advanced model, here, is one that can operate the skills
named in this paper.
.Sh PRAXIS
All of
.Xr pqac 7
PRAXIS still applies: empty interpretation, combinators, moving
.Em Obj
alphabet, login cut, RDTUN ifnets, ZFS extattr, integrity as a bug,
conjunction is not a product, recovery inside isolation, authentication
still in front.
Additionally:
.Bl -bullet
.It
Genesis is a named record.
.It
Event integrity is not payload integrity.
Do not pretend a scrub discharges T10.
.It
Sign the bits that run
.Pq T11, T15 .
Do not wrap ZFS keys in RSA.
.It
Do not rebrand an untrusted box
.Pq T12 .
.It
Do not report the suite as a single bit
.Pq T14 .
.It
Do not ship
.Dq provably secure
without the bounds sheet
.Pq T16 .
.It
Do not
.Xr kldload 8
in the interview.
.Cm test*
before each
.Cm one* .
.It
via-port:
.Nm pqfreebsd-llm-check
before
.Cm oneenforce .
.El
.Sh SEE ALSO
.Xr pqac 7 ,
.Xr pqfreebsd 4 ,
.Xr pqfreebsd.conf 5 ,
.Xr pqfreebsd 8 ,
.Xr pqledger 8 ,
.Xr pqdac 8 ,
.Xr mac_grok 8 ,
.Xr mac_lomac 4 ,
.Xr audit 4 ,
.Xr ugidfw 8 ,
.Xr setfsmac 8 ,
.Xr zfs 8 ,
.Xr loader.conf 5
.Pp
Anderson, J. P., ESD-TR-73-51, 1972.
Harrison, M. A., Ruzzo, W. L., Ullman, J. D., CACM 19(8), 1976.
NIST FIPS 203, 204, 205.
.Xr pqac 7
for Bell, Biba, Fraser, Goguen–Meseguer, Shor, Grover, and the plant.
The TrustedBSD papers are in
.Sx TRUSTEDBSD
above; they are not in the base install.
.Sh HISTORY
Spoken the same day as
.Xr pqac 7
as the missing morphisms: evidence and repaired
.Em A_D .
Extended the same day as a living paper: T10–T17 recorded as the suite
grew
.Pq payload, code-auth, gated loader, successive policy, piecemeal claims, chain of trust, parameterized bounds, via-port LLM .
This page is updated as morphisms land.
.Xr pqac 7
remains the basis and is not rewritten for each morphism.
.Sh AUTHORS
.An Grok
and the operator of
.Nm freebsd-mac-grok ,
2026-08-22.
.An Brian Fundakowski Feldman
is a co-author of the TrustedBSD MAC Framework papers
.Pq DISCEX III 2003, USENIX ATC 2003 .
The Framework is Watson et al.; this suite consumes it.
.Sh BUGS
.Dq Post-quantum
still denotes Kyber unless
.Xr pqac 7
is said aloud.
This paper is unsigned.
The splash mark is not a second signature family.
The port cannot prove a model is advanced.
.Sh LICENSE
Light-ware License.
Copyright (c) 2026 Brian Fundakowski Feldman.
This product includes software developed by Brian Fundakowski Feldman.
See
.Pa LICENSE
in the source distribution.
